app/controllers/catalogo_controller.rb

SELECT * FROM "productos" LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "productos"
---
  def index
    @productos = Producto.paginate(:page => @page)