app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if (@post.save)
---
INSERT INTO "posts" ("comentario", "created_at", "usuario_id", "titulo", "updated_at") VALUES('comentario1', '2009-09-09 19:30:36', 1, 'titulo11', '2009-09-09 19:30:36')