app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT * FROM "productos"

  def show
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)

  def edit
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)

  def create
    @producto = Producto.new(params[:producto])

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("created_at", "nombre", "foto_file_size", "updated_at", "precio", "foto_content_type", "foto_file_name") VALUES('2009-09-09 21:07:04', 'mundo', 135074, '2009-09-09 21:07:04', 3.54, 'image/jpeg', '3d_Water_World.jpg')

  def update
    @producto = Producto.find(params[:id])

    respond_to do |format|
      if @producto.update_attributes(params[:producto])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)
UPDATE "productos" SET "updated_at" = '2009-09-09 21:15:02', "foto_file_size" = 55820, "foto_file_name" = 'the_world_dubai.jpg' WHERE "id" = 1