app/controllers/sessions_controller.rb

  def create
    u = Usuario.find_by_login(params[:login])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."login" = 'asdf') LIMIT 1