app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT * FROM "usuarios"

  def show
=begin
    unless session[:usuario].nil?
      if session[:usuario][:tipo] == 'admin'
        @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "nombre", "updated_at", "fecha_nacimiento", "login", "password", "apellido") VALUES('2009-09-09 16:08:07', 'felix', '2009-09-09 16:08:07', '2009-09-09', 'felix', 'felix', 'carreño')

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2)
UPDATE "usuarios" SET "updated_at" = '2009-09-10 15:48:21', "email" = 'email@correo.com', "tipo" = 'admin', "password" = '19f156ea6c24f65693b58ce808599348e4c9cf2a' WHERE "id" = 1